---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedMaterialTypes
source: html/3229047b-1e5c-3ef4-ac1e-5efaf31a480c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedMaterialTypes Property

"Material Types"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewGraphSchedMaterialTypes { get; }
```